[
  {
    "slug": "teeth-whitening",
    "title": "Teeth Whitening",
    "intro": [],
    "sections": [
      {
        "heading": "Teeth Whitening Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "While most dental treatments focus on the health and function of teeth, the appearance of your teeth is also important. When you meet people for the first time, they look at your face and your smile. The appearance of your teeth can help you make a good first impression."
          },
          {
            "type": "paragraph",
            "text": "What we eat and drink can affect the teeth, causing stains. If your teeth have yellowed due to coffee, tea or alcohol consumption, smoking, age or medication use, you can whiten them with bleaching products. You can conveniently brighten teeth in the comfort of your home using whitening strips, toothpaste and mouthwashes from your local drugstore. You can also opt for a professional whitening from your dentist. In-office whitening procedures are more expensive than over-the-counter products. However, the results are professional and last a long time. Your smile is worth it! Schedule a dental whitening session with Southborough Dental Partners today."
          }
        ]
      },
      {
        "heading": "The Process",
        "body": [
          {
            "type": "paragraph",
            "text": "Our solution can whiten teeth up to 8 shades. Before whitening your teeth, they will need to be cleaned first. After the cleaning, the preparation begins. Your gums and lips will be covered. A whitening gel made of hydrogen peroxide will be placed on the teeth. The dentist will use a special light to break up the stains on your teeth. The gel stays on for 15 minutes. There are three stages involved, so the gel will stay on for 45 minutes altogether. Afterward, a fluoride gel is applied to the teeth."
          }
        ]
      },
      {
        "heading": "What to Know",
        "body": [
          {
            "type": "paragraph",
            "text": "The entire process takes about an hour. After the whitening, you will be given trays to take home, allowing you to touch up the results as needed. Note that whitening is not covered by insurance, so expect to pay for the procedure out of pocket. Teeth whitening is relatively safe. It will not harm your teeth. It is a quick fix that can improve your self-confidence."
          },
          {
            "type": "paragraph",
            "text": "Some people do experience sensitivity and even mild tingling after getting their teeth whitening professionally. Ask your dentist for a sensitive tooth toothpaste to alleviate this. Whitening often does not work on crowns or fillings, so keep that in mind. also, the whitening does not last forever. Certain foods and beverages can cause stains to resurface, which means you may need to redo the process. Professional whitening should not be used on children under the age of 13, as well as women who are pregnant or nursing. Teeth whitening does not work the same on all people. Some are able to experience greater effects than others. Consult with your dentist to see if teeth whitening is right for you."
          }
        ]
      },
      {
        "heading": "Contact Us Today",
        "body": [
          {
            "type": "paragraph",
            "text": "While you can temporarily whiten your teeth by using over-the-counter strips, toothpastes, mouthwashes and other products, a trip to the dentist's office can provide you with a long-lasting smile you'll be proud to show off. Schedule a consultation today. Call the office of Southborough Dental Partners at (508) 357-8800 . We look forward to serving you!"
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/teeth-whitening-southborough-ma/"
  },
  {
    "slug": "invisalign",
    "title": "Invisalign",
    "intro": [],
    "sections": [
      {
        "heading": "Invisalign Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "Many people suffer from dental alignment issues. In the past, only metal braces were used to straighten teeth. Fortunately, people now have an option. Technology has advanced significantly since then, allowing those with alignment issues to use clear aligners such as Invisalign. Invisalign uses a set of clear plastic aligners to straighten teeth discretely. Nobody has to know. Invisalign can fix mild to moderate cases of crowding, underbite, overbite, crossbite, open bite and gapped teeth. Your dentist will use 3D imaging to create aligners that are customized for your mouth. If you're interested in straightening your teeth, Southborough Dental Partners can determine if Invisalign is the right choice for you."
          }
        ]
      },
      {
        "heading": "The Process",
        "body": [
          {
            "type": "paragraph",
            "text": "The first step is to schedule a consultation with your dentist. Your dentist will assess your smile and determine if Invisalign will help you achieve the smile you desire. If you are a good candidate, the dentist will take a smile scan, which involves 3D images of your teeth. The doctor uses special software to fine-tune each shift in your teeth. Each time your teeth shift, you will be given a new set of aligners. This treatment plan is sent to the lab and your aligners are created using innovate SmartTrack material, which make the aligners comfortable to wear. Your aligner is then trimmed to fit your gumline. The lab will then do a quality check to ensure that your aligners are perfect, with no defects."
          }
        ]
      },
      {
        "heading": "Pros and Cons",
        "body": [
          {
            "type": "paragraph",
            "text": "No teeth straightening system is perfect, so here are some pros and cons to consider before choosing Invisalign. First of all, Invisalign is more comfortable than braces, since there are no wires or brackets to poke your cheeks and gums. Invisalign is also more attractive. The clear aligners don't stand out like braces do, so you feel less self-conscious about them. You can smile freely."
          },
          {
            "type": "paragraph",
            "text": "Invisalign can also make your teeth cleaner and healthier. The aligners are removed when you eat, so you can brush and floss your teeth normally. You don't have to worry about special cleaning techniques. Plus, you don't have to avoid your favorite foods. The aligners must be worn for at least 23 hours a day. They also require cleaning to avoid bacterial build up."
          }
        ]
      },
      {
        "heading": "Contact Us Today",
        "body": [
          {
            "type": "paragraph",
            "text": "Invisalign can treat a variety of alignment issues without interrupting your busy life. Schedule a consultation with Southborough Dental Partners. Call our office today at (508) 357-8800 . We look forward to serving you!"
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/invisalign-southborough-ma/"
  },
  {
    "slug": "dental-implants",
    "title": "Dental Implants",
    "intro": [],
    "sections": [
      {
        "heading": "Dental Implants Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "Replace missing teeth with dental implants. These titanium artificial tooth roots are anchored into the jawbone. Not only do implants replace missing teeth, but they also preserve the jawbone. Also, dental implants require the easy maintenance. Many patients prefer implants because of the natural looking results. In addition, the results last for several years. Learn more about dental implants below."
          },
          {
            "type": "paragraph",
            "text": "Implants require an exam and medical history review. Your dentist will asses the following:"
          },
          {
            "type": "list",
            "items": [
              "Jawbone health and structure",
              "Location of missing tooth",
              "Medical history and current medication",
              "Cost or insurance coverage"
            ]
          },
          {
            "type": "paragraph",
            "text": "Implants need a sturdy, thick jawbone. Less dense jawbone may require bone grafting or another teeth replacement option. Nonetheless, your dentist will explain your treatment plan."
          },
          {
            "type": "paragraph",
            "text": "The procedure uses a local anesthetic to assure the patient is comfortable. Afterward, we recommend over-the-counter pain medication. Any discomfort will subside in a few days. However, the dental implant area needs up to 6 months to heal. During this time, the dental crown is being made. In the meantime, patients will have a temporary crown."
          }
        ]
      },
      {
        "heading": "Procedure",
        "body": [
          {
            "type": "paragraph",
            "text": "Implants have been used in dentistry for more than 30 years. The procedure is safe and recommended to patients that meet certain health criteria. For this reason, a thorough examination and medical histroy review is required. If your dentist does not recommend implants, other options are avaliable. Dentures and dental bridges are alternatives."
          }
        ]
      },
      {
        "heading": "Maintenance",
        "body": [
          {
            "type": "paragraph",
            "text": "Implants require simple dental care. We recommend brushing your teeth at least twice a day and flossing daily. Avoid hard food as they may damage the dental crown. Also, be sure to maintain your dental exams and cleanings. Although implants are false teeth, periodontal disease can affect them. More information on dental implant maintenance will be discussed during your consultation."
          }
        ]
      },
      {
        "heading": "Contact",
        "body": [
          {
            "type": "paragraph",
            "text": "Replacing missing teeth is essential for your oral health. In fact, missing teeth can cause unnatural teeth shifting, decay, and periodontal disease. Find out if dental implants are right for you! Southborough Dental Partners offers dental implant consultations. Call (508) 357-8800 or book an appointment online. New patients are always welcome and most insurances are accepted. We look forward to meeting you."
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/dental-implants-southborough-ma/"
  },
  {
    "slug": "dental-crowns",
    "title": "Dental Crowns",
    "intro": [],
    "sections": [
      {
        "heading": "Dental Crowns Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "Dentists have many options to help patients restore the function and appearance of their smile. One of them is a dental crown. Also known as a cap, a dental crown covers the entire tooth. It can be used for functional or cosmetic purposes. In addition, there are many reasons to use a crown. For example, they can be used to protect or restore weak and decaying teeth. If a tooth has a large filling, a crown can cover it up and support it. Also, a dental crown can be used to cover a dental implant, hold a bridge in place and cover up teeth that are discolored or misshapen."
          },
          {
            "type": "paragraph",
            "text": "There are both temporary and permanent crowns available, as well as crowns made of various materials such as metal, porcelain, ceramic and resin. There are pros and cons of each of these. Contact Southborough Dental Partners to learn more about crowns."
          }
        ]
      },
      {
        "heading": "The Process",
        "body": [
          {
            "type": "paragraph",
            "text": "A crown requires two visits. First, the dentist will numb the tooth and surrounding gum tissue. Next, the tooth is filed down to make room for the crown. If a large area of the tooth is already missing, filling material is used to build up the tooth."
          },
          {
            "type": "paragraph",
            "text": "Once the tooth has been reshaped, the dentist will make an impression of the tooth using paste or putty. In addition, a digital scanner may be used."
          },
          {
            "type": "paragraph",
            "text": "The impressions or scans are sent to a dental lab so the crown can be created. The crown will be ready in approximately 2-3 weeks. Nonetheless, you will receive a temporary crown at the first office visit. This crown is made of acrylic and held in place with cement."
          },
          {
            "type": "paragraph",
            "text": "At the second visit, you will receive your permanent crown. The dentist will check the fit and color. If everything looks good, it will be cemented in place."
          }
        ]
      },
      {
        "heading": "Pros and Cons",
        "body": [
          {
            "type": "list",
            "items": [
              "Metal. Metal crowns are the strongest. They last a long time and are thin, requiring less material to be removed from the tooth. The metallic color really stands out. Likewise, some people develop allergic reactions to the material.",
              "Porcelain fused to metal. This crown is fairly strong thanks to the added metal. The porcelain, however, can crack or chip. In addition, the metal can sometimes show up as a dark line.",
              "Ceramic. Ceramic crowns have a natural look. They can be made to match existing teeth. However, they are not as strong as metal crowns.",
              "Resin. Resin crowns are the least expensive and they are easy to make. However, they are also fairly weak and prone to fracture."
            ]
          }
        ]
      },
      {
        "heading": "Contact Us to Learn About Dental Crowns",
        "body": [
          {
            "type": "paragraph",
            "text": "If your teeth are weak, cracked or simply unattractive, a dental crown can improve the aesthetics of your smile and make you feel more confident. Which type of crown is right for you? Schedule a consultation with Southborough Dental Partners and find out. In addition, we can be reached at (508) 357-8800 . We look forward to serving you!"
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/dental-crowns-southborough-ma/"
  },
  {
    "slug": "dental-veneers",
    "title": "Dental Veneers",
    "intro": [],
    "sections": [
      {
        "heading": "Dental Veneers Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "A dentist can not only make your teeth health but attractive as well. Making your teeth look better is called cosmetic dentistry, and there are many options to choose from nowadays. If you have been struggling with a less than ideal smile for a long time, you no longer have to be embarrassed. Most dentists now offer dental veneers to improve your smile."
          },
          {
            "type": "paragraph",
            "text": "Dental veneers are wafer-thin shells that are bonded to the front of the teeth. Veneers can fix a variety of dental issues. They can whiten teeth that have been stained through smoking, coffee and tea consumption and medications. Teeth that have been worn down or chipped can be fixed with veneers. So can teeth that have been misaligned, misshapen or uneven. Veneers can even fill in large gaps between teeth without the need for braces or other orthodontic appliances. If you're interested in how veneers can enhance our smile, contact Southborough Dental Partners today."
          }
        ]
      },
      {
        "heading": "The Process",
        "body": [
          {
            "type": "paragraph",
            "text": "The process of applying veneers can be broken down into three main steps: treatment planning, preparation and bonding. The treatment process involves the dentist examining your teeth and taking X-rays and impressions. During this visit, you will explain your goals and the dentist will explain the limitations."
          },
          {
            "type": "paragraph",
            "text": "To prepare the teeth for the veneers, the dentist has to remove some enamel from the teeth. About ½ millimeter is removed from the tooth's surface to allow the veneer to bond to your tooth. The dentist will then create a model of your tooth and send it to the lab so your customized veneer can be created. Your veneer should be ready in 2-4 weeks."
          },
          {
            "type": "paragraph",
            "text": "When your veneer is ready, you will return to the dentist to get it placed. Before the final placement, it will be placed on your tooth to ensure proper fit and color. The veneer can be trimmed by the dentist and a special cement can change the color."
          },
          {
            "type": "paragraph",
            "text": "The tooth will then be cleaned and polished. It will also be etched, which makes the tooth rougher and allows for a stronger bonding. The dentist will then place cement on the tooth and apply the veneer. Also, special light is used to activate the cement and make it harden quickly."
          },
          {
            "type": "paragraph",
            "text": "Next, the dentist will remove any excess cement, evaluate your bite and make any other adjustments. You may need to return for a follow-up appointment in a few weeks to make sure everything is going smoothly. Care for your veneers like you would your natural teeth. No special care is required. Brush and floss normally. Porcelain veneers are stain-resistant, so you can eat and drink all your favorite foods and beverages."
          }
        ]
      },
      {
        "heading": "Contact Us Today",
        "body": [
          {
            "type": "paragraph",
            "text": "Veneers can help you achieve the smile of your dreams. A perfect smile is within reach. Contact Southborough Dental Partners to learn more about veneers and other cosmetic dentistry options. Call our office today at (508) 357-8800 to schedule a consultation ."
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/dental-veneers-southborough-ma/"
  },
  {
    "slug": "dental-bonding",
    "title": "Dental Bonding",
    "intro": [],
    "sections": [
      {
        "heading": "Dental Bonding Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "If you are looking for an easy and inexpensive to improve the appearance of your teeth, consider dental bonding. Bonding uses a composite resin material that is similar to plastic and can be color-matched to your existing teeth. This flexible material is similar to putty and is shaped and polished to match your other teeth. You can use bonding to fix a variety of issues, such as cracks, gaps, discoloration and more."
          },
          {
            "type": "paragraph",
            "text": "Bonding is a cosmetic procedure that requires minimal preparation. A conditioning gel is applied to the tooth to help the material bond better. The resin is then hardened with an ultraviolet light. No anesthesia is required and you can easily improve your smile in just one visit. In fact, the process takes less than an hour. Of all the cosmetic dentistry options, bonding is probably the least expensive. If your teeth have flaws that you would like to fix, contact Southboro Dental Partners today and see if bonding is the right choice for you."
          }
        ]
      },
      {
        "heading": "Pros and Cons of Dental Bonding",
        "body": [
          {
            "type": "paragraph",
            "text": "Bonding offers many benefits to those looking to improve their smile. Bonding can help with a variety of cosmetic issues. If your teeth are chipped, cracked or broken, bonding can make them look good as new. Bonding can also help with discoloration, so if your teeth are stained due to smoking or consumption of coffee, tea or alcohol, then bonding can help them look whiter and brighter. If you have gaps in between certain teeth and do not want the inconvenience of braces, bonding can close in the gaps. Bonding is also inexpensive. With bonding, you can improve your smile in about an hour. Bonded teeth are easy to care for - just brush and floss normally."
          },
          {
            "type": "paragraph",
            "text": "Bonding has some disadvantages you should be aware of. It is not stain-resistant, so you need to be mindful of your food and beverage and lifestyle habits that can cause staining. While bonding can last 4-8 years with good care, other options such as veneers last much longer. Bonding can wear away over time, so you have to be careful when biting. You should avoid chewy and crunchy foods to preserve the bonded tooth. Also, bonding is typically not covered by dental insurance, so expect to pay out of pocket."
          }
        ]
      },
      {
        "heading": "Contact Us Today",
        "body": [
          {
            "type": "paragraph",
            "text": "Dental bonding is an effective and inexpensive choice to repair teeth or make them look better. If you want to improve your smile, bonding allows you to do so easily for just a few hundred dollars a tooth. Are you a good candidate for bonding? Schedule a consultation with Southborough Dental Partners today and learn more about the bonding process. Call our office at (508) 357-8800 . We look forward to serving you!"
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/dental-bonding-southborough-ma/"
  },
  {
    "slug": "dental-bridge",
    "title": "Dental Bridge",
    "intro": [],
    "sections": [
      {
        "heading": "Dental Bridge Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "If you are missing teeth due to disease or injury, you may be considering replacing them. However, dental implants can be cost-prohibitive. While they look and function like real teeth, they can cost a few thousand dollars per tooth, and they are not covered by insurance. Fortunately, bridges are a less costly alternative. Bridges use false teeth called pontics to fill in the gaps in your mouth. The pontic is held in place by abutment teeth, which are the teeth on either side of the gap. If you are missing multiple teeth and don't have abutment teeth, there are still ways to accomplish your smile goals with a bridge. There are several types of bridges to choose from. Southborough Dental Partners can help you choose the right one for your needs."
          }
        ]
      },
      {
        "heading": "Types of Bridges",
        "body": [
          {
            "type": "paragraph",
            "text": "There are four types of dental bridges:"
          },
          {
            "type": "list",
            "items": [
              "Traditional. Traditional bridges are the most common. Dental crowns are cemented onto the abutment teeth on both sides of the missing tooth. These abutment teeth then hold the pontic in place. You can use a traditional bridge if you have abutment teeth.",
              "Maryland. A Maryland bridge is similar to a traditional bridge. It still requires abutment teeth. The main difference, however, is that instead of crowns, framework is used. This porcelain or metal framework is bonded to the backs of the abutment teeth.",
              "Cantilever. A cantilever bridge is another variation of the traditional bridge. This type of bridge requires just one abutment tooth, however, so you don't need one on both sides.",
              "Implanted-supported. As the name suggests, an implant-supported bridge used dental implants rather than pontics. If a person is missing multiple teeth, pontics and implants can be used. This is the strongest type of the bridge, but also the most costly and time-consuming."
            ]
          }
        ]
      },
      {
        "heading": "Pros and Cons",
        "body": [
          {
            "type": "paragraph",
            "text": "Bridges offer many advantages. They look and feel like real teeth, so they offer a natural look. Inaddition, theyare permanent fixtures that stay in your mouth, unlike dentures. Bridges also last a long time. With proper care, you can expect your bridge to last as long as 15 years. They are durable and can withstand everyday chewing. Bridges are also less costly than options such as dental implants."
          },
          {
            "type": "paragraph",
            "text": "There are some downsides, though. Bridges are unlike natural teeth in that the teeth are fused together. Therefore, you cannot floss normally, making cleaning a challenge. Another thing to consider is that the abutment teeth have to be grinded down for the bridge to work properly. Most patients are fine with this, but to others, it is a concern."
          },
          {
            "type": "paragraph",
            "text": "Another thing to consider is the longevity. The bond can weaken over time, and many patients have to replace their bridges at least every decade."
          }
        ]
      },
      {
        "heading": "Contact Us Today",
        "body": [
          {
            "type": "paragraph",
            "text": "If you have gaps in your mouth due to missing teeth, a bridge can close these gaps and make your smile more aesthetically pleasing. A bridge can also make your jaw healthier, so if you've been considering fixing your smile, this is a great option. If you're tired of a gap-toothed smile, restore your confidence with a bridge. The team at Southborough Dental Partners can help you achieve your smile goals. Contact our office and schedule a consultation by calling (508) 357-8800 ."
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/dental-bridge-southborough-ma/"
  },
  {
    "slug": "dentures",
    "title": "Dentures",
    "intro": [],
    "sections": [
      {
        "heading": "Dentures Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "If you are missing teeth, you can replace them with dentures. Dentures are fake teeth that can removed from the mouth. They are a good choice for those missing most of their teeth. If you are missing just a few teeth, you can opt for partial dentures or consider dental bridges or implants. Dentures can be a bit awkward at first. However, technology is making dentures more comfortable and realistic. If you are missing teeth, dentures can help in many ways. They allow you to eat your favorite foods. In addition, they allow you to smile and speak normally, so you no longer have to be self-conscious about your mouth. Also, the set helps prevent sagging, which can occur when there are no teeth to support your jaw. If you are missing teeth, you may benefit from this option. Southborough Dental Partners can help you understand your options."
          }
        ]
      },
      {
        "heading": "Types of Dentures",
        "body": [
          {
            "type": "list",
            "items": [
              "Conventionals. This is the most common type of denture. The teeth are removed and your mouth heals. This can take several months, and you will be without teeth during this time.",
              "Immediates. This denture is convenient, as you are not without teeth. The dentist takes measurements before all the teeth are removed. Once they are removed, your denture is placed in your mouth right away. With this type of denture, you must come in multiple times for adjustments, as the bone reshapes as it heals.",
              "Partials. Partials are an alternative to bridges. It involves metal framework that is attached to existing teeth. These are used when you need to replace a few teeth, not an entire mouth."
            ]
          }
        ]
      },
      {
        "heading": "Maintenance",
        "body": [
          {
            "type": "paragraph",
            "text": "Removable mouth appliances require more care than natural teeth and other tooth replacement options. Be careful when handling them, as they are delicate. You should never let them dry out. If they are without water for too long, they can change shape, which will make them unwearable. When they're not in your mouth, keep them in cool water. Hot water can warp them."
          },
          {
            "type": "paragraph",
            "text": "Brush your set daily. This will remove food particles and prevent staining. Before putting your set in your mouth, brush your tongue and gums as well. This helps with plaque removal."
          },
          {
            "type": "paragraph",
            "text": "If your set ever chip, break or crack, do not attempt to fix them on your own. This can cause them to become damaged even further. Consult with your dentist. Visit your dentist regularly. Dentures tend to loosen over time as the gums shrink due to age. Your set will need to be relined, rebased or even fully remade over time. Furthermore, expect your set to last 5-8 years with proper care."
          }
        ]
      },
      {
        "heading": "Contact Us Today",
        "body": [
          {
            "type": "paragraph",
            "text": "Dentures are a good choice for replacing multiple missing teeth. By choosing dentures, you are helping your mouth look and function at its best. If dental implants are out of your budget, consider dentures. There are several options to choose from. To learn, schedule a consultation with Southborough Dental Partners by calling (508) 357-8800 . We look forward to serving you!"
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/dentures-southborough-ma/"
  },
  {
    "slug": "root-canal",
    "title": "Root Canal Treatment",
    "intro": [],
    "sections": [
      {
        "heading": "Root Canal Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "Root canal treatments are performed on teeth that have excessive decay or infection. In brief, the natural cavity in the center of the tooth is called the root canal and the soft area within the root canal is the pulp. There is also a nerve that lies within the root canal. The nerve and pulp are removed from the tooth. The dentist then cleans and seals the inside the tooth to prevent further decay from forming. A crown or other restoration is then placed on the affected tooth to restore full function. If a root canal is not performed, the tooth can become abscessed and may need to be removed."
          },
          {
            "type": "paragraph",
            "text": "Having the nerve removed from the tooth will not affect the use of the tooth too much. It only serves as a sensory function - to provide hot and cold sensations. The tooth can still function without a nerve. The pulp is removed when it has become damaged. Keeping it in the tooth only causes bacteria to multiply. These bacteria can lead to infections and abscesses, which are pockets of pus found in the roots of the tooth. Abscesses and infections can cause swelling, drainage problems and bone loss."
          }
        ]
      },
      {
        "heading": "Do I Need a Root Canal?",
        "body": [
          {
            "type": "paragraph",
            "text": "The team at Southborough Dental Partners can assess your mouth and determine if you need a root canal. Here are some signs that you might need one:"
          },
          {
            "type": "list",
            "items": [
              "A cracked or chipped tooth",
              "Pain while biting or chewing",
              "Pimples on the gums",
              "Tender or swollen gums",
              "Darkening of the gums",
              "Severe decay",
              "Extreme sensitivity to hot or cold"
            ]
          }
        ]
      },
      {
        "heading": "Are Root Canals Painful?",
        "body": [
          {
            "type": "paragraph",
            "text": "You will likely feel less pain after the procedure, since you will no longer have the pain of the toothache. Likewise, the inflammation and infection will be eliminated. During the actual procedure, you will be given anesthetics so you will feel comfortable."
          },
          {
            "type": "paragraph",
            "text": "For a few days after the root canal treatment, your teeth will likely be sensitive. The dentist will give you medications to control the pain. For example, over-the-counter pain relievers will be helpful. After your procedure, avoid eating for several hours, as you will have numbness in your mouth and you do not want to accidentally bite your cheek or tongue. For the first few days, eat soft foods such as eggs and applesauce. Consequently, hard foods may hurt your teeth."
          }
        ]
      },
      {
        "heading": "Contact Us Today",
        "body": [
          {
            "type": "paragraph",
            "text": "If your tooth is infected or badly decayed, you can save it with help from Southborough Dental Partners. Call our office at (508) 357-8800 to schedule an appointment."
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/root-canal-southborough-ma/"
  },
  {
    "slug": "dental-exam",
    "title": "Dental Exam",
    "intro": [],
    "sections": [
      {
        "heading": "Dental Exam Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "Our teeth keep us alive in a way, as they help us chew and eat food. Without healthy teeth, eating can be an unpleasant and even painful experience.This is why dentists recommended dental exams twice a year, or every six months. Poor dental care can actually affect your entire body. In some cases, dentists are able to diagnose certain medical conditions based on the appearance of your teeth and gums. Visiting your dentist often can keep you healthy, keep your teeth clean and help manage issues before they become major problems."
          },
          {
            "type": "paragraph",
            "text": "Call Southborough Dental Partners and schedule a dental exam. Our team is dedicated to your oral health."
          }
        ]
      },
      {
        "heading": "What to Expect",
        "body": [
          {
            "type": "paragraph",
            "text": "Dental exams are often performed by both a dentist and a hygienist. The hygienist focuses on cleaning your teeth, while the dentist will examine your teeth and ensure they are healthy. Your dentist will look for issues such as tooth decay, gingivitis and gum disease. If any of these problems are found, your dentist will advise follow-up treatment."
          },
          {
            "type": "paragraph",
            "text": "The hygienist will start the dental exam by cleaning your teeth. Small instruments such as mirrors and scalers are used to navigate around your mouth. The scaler scrapes the teeth to remove plaque and tartar. Plaque is a sticky film that contains bacteria. Plaque can be removed through regular brushing. If left on the teeth too long, though, it can harden and turn to tartar, which is even harder to remove."
          },
          {
            "type": "paragraph",
            "text": "Once the surfaces of your teeth are clean, the hygienist will then floss your teeth. He or she will then brush your teeth with a powerful electric toothbrush. The brush scrubs your teeth using a gritty toothpaste. If your teeth are prone to cavities, the hygienist may recommend fluoride. Children tend to get fluoride more often than adults. Once your cleaning is done, the hygienist may offer advice about keeping your teeth even cleaner."
          }
        ]
      },
      {
        "heading": "Dental X-rays",
        "body": [
          {
            "type": "paragraph",
            "text": "Dental exams often involved X-rays. X-rays are taken every 1-2 years, depending on the health of your mouth. They are helpful for dentists because they can identify issues that cannot be seen during a visual exam, such as decay hidden in between teeth. The X-rays can also help your dentist evaluate your bite and jaw alignment and look for oral cancer and other health issues. There are full-mouth X-rays, which take a panoramic view of your mouth. Bitewing X-rays focus on certain areas and are good for identifying cavities. The dentist will then evaluate the X-rays and check your teeth and gums for any issues."
          }
        ]
      },
      {
        "heading": "Contact Us for Your Dental Exam",
        "body": [
          {
            "type": "paragraph",
            "text": "Regular exams can keep your teeth clean and healthy for life. Avoid serious oral health issues by visiting us twice a year. Schedule your appointment today."
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/dental-exam-southborough-ma/"
  },
  {
    "slug": "dental-cleaning",
    "title": "Dental Cleaning",
    "intro": [],
    "sections": [
      {
        "heading": "Dental Cleaning Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "Many people dread going to the dentist, even for a simple dental cleaning. However, a clean mouth is a healthy mouth. The process is painless and when you're all done, you can enjoy minty-fresh breath and a sparkly smile. Even if you brush and floss at home on a daily basis, plaque and tartar can still accumulate on your teeth and gums. If left untreated, this can lead to gingivitis and other serious oral health conditions. That's why dentists recommend that you come in twice a year, or every six months, for a professional cleaning. Your teeth are important for eating, speaking and smiling. Keep them clean and healthy for life with regular dental cleanings. Southboro Dental Partners can help."
          }
        ]
      },
      {
        "heading": "What to Expect",
        "body": [
          {
            "type": "paragraph",
            "text": "If you know what to expect, then the visit can be more comfortable. Dental cleanings are often performed by hygienists who are skilled at cleaning and examining the mouth. The first step is a physical exam. This involves the use a tiny mirror that is placed in various areas of the mouth so the hygienist can examine your teeth and gums in hard-to-reach places, such as the back of the mouth. They will look for issues such as inflamed gums or decayed teeth. If they come across such issues, they may have a dentist look at your mouth to determine if immediate action needs to be taken or if the cleaning can proceed as planned."
          },
          {
            "type": "paragraph",
            "text": "The hygienist will then clean your teeth. He or she will use a tool called a scaler to remove plaque and tartar from the teeth and gums. This process can take some time, depending on how well you brush your teeth. Teeth with fillings and crowns are also cleaned during this process."
          },
          {
            "type": "paragraph",
            "text": "Once all the debris is removed from your teeth, the hygienist will brush them with a high-powered electric brush and gritty toothpaste. The brush and toothpaste work to scrub your teeth and make them shiny."
          },
          {
            "type": "paragraph",
            "text": "The next step is a professional flossing. Hygienists are experts as flossing and can ensure that all debris is removed from in between the teeth. They can help you understand where you can floss better. After the flossing, you will rinse out your mouth to remove any leftover debris."
          }
        ]
      },
      {
        "heading": "Additional Service",
        "body": [
          {
            "type": "paragraph",
            "text": "If you have dentures or other removable appliances, they will be adjusted and cleaned during this time. Sometimes fluoride and sealants are recommended for children who are prone to cavities."
          },
          {
            "type": "paragraph",
            "text": "If the hygienist found any issues during the cleaning, then the dentist may follow up to see if you need to make another appointment. You may also receive information about nutrition and proper hygiene at home."
          }
        ]
      },
      {
        "heading": "Contact Us Today",
        "body": [
          {
            "type": "paragraph",
            "text": "Brushing and flossing at home is not enough to remove debris from teeth and make them sparkly clean. A professional dental cleaning twice a year can remove plaque and tartar and make your smile gorgeous. Is it time for a dental cleaning? If so, schedule an appointment with Southborough Dental Partners today. Call our office today at (508) 357-8800 ."
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/dental-cleaning-southborough-ma/"
  },
  {
    "slug": "dental-fillings",
    "title": "Dental Fillings",
    "intro": [],
    "sections": [
      {
        "heading": "Dental Fillings Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "Even if you brush and floss daily, your teeth can still develop decay. Poor eating habits can cause plaque and tartar to develop, leading to cavities. When you develop a cavity, the dentist often fixes it with a dental filling. A dentist uses various materials to fill in the space caused by the decay. A filling stops the decay from getting worse. Sometimes people develop cavities and don't even realize it. Don't wait too long to treat your decay or you could end up losing your tooth and developing other oral health issues. Schedule an appointment with Southborough Dental Partners and see if you could benefit from a filling."
          }
        ]
      },
      {
        "heading": "The Process",
        "body": [
          {
            "type": "paragraph",
            "text": "Placing a filling involves several steps. The dentist may numb the area around the affected tooth so the process is pain-free. The dentist will then use a drill to cut through the tooth and remove all decay. The space is then prepared for the filling."
          },
          {
            "type": "paragraph",
            "text": "For certain fillings, the tooth may be etched first. A special light may be used to harden the material and make it as strong as possible. Once the filling is placed, the dentist will polish the tooth."
          },
          {
            "type": "paragraph",
            "text": "In some cases, a crown may be needed. A crown can protect the tooth if it is fractured or severely decayed. A root canal may be needed if the decay has reached the nerve. To keep the nerve alive, pulp capping may be recommended."
          }
        ]
      },
      {
        "heading": "Types of Dental Fillings",
        "body": [
          {
            "type": "list",
            "items": [
              "Porcelain. Porcelain is one of the most expensive options for fillings. However, they offer a natural look and cover most of the tooth. They can be color-matched to match your other teeth. They are also highly resistant to staining. Porcelain fillings are created in a lab and bonded to the teeth.",
              "Gold. Gold fillings are also on the high end in terms of cost. They are also lab-created and bonded to the tooth. Many people choose gold because they are well-tolerated and can last 20 years with proper care. However, they are highly noticeable.",
              "Silver. Also called amalgam fillings, silver fillings are the least expensive and do not wear down easily. However, they are highly noticeable, and as such, are often used on back teeth.",
              "Composite. Composite fillings, like porcelain, offer a natural look. They are made of plastic and can match the color of your teeth. The ingredients are mixed and placed in the cavity, where they harden. Composite fillings tend to chip over time, however, and do not work well for larger cavities. They also do not last as long and tend to stain easily."
            ]
          }
        ]
      },
      {
        "heading": "Contact Us Today",
        "body": [
          {
            "type": "paragraph",
            "text": "You can keep a decaying tooth from getting worse by getting a dental filling. There are several types of fillings to choose from. A consultation with a dentist can help you make the right choice."
          },
          {
            "type": "paragraph",
            "text": "If you have a cavity, only a dentist can tell you if it needs to be filled. Make an appointment with Southborough Dental Partners today. Call (508) 357-8800. We look forward to serving you."
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/dental-fillings-southborough-ma/"
  },
  {
    "slug": "pediatric-dentistry",
    "title": "Pediatric Dentistry",
    "intro": [],
    "sections": [
      {
        "heading": "Pediatric Dentist Southborough MA",
        "body": [
          {
            "type": "paragraph",
            "text": "Good oral health starts early with a pediatric dentist. Many children begin getting teeth when they are just several months old. This means that dental checkups should begin with a child's first birthday. If you are waiting until your child attends school, your child may already have cavities and other dental issues."
          },
          {
            "type": "paragraph",
            "text": "This is why visiting a pediatric dentist early in your child's life is important. Pediatric dentists are tailored to children and understand that many have a fear of the dentist. They provide gentle dental care to children of all ages, even those with special needs. Pediatric dentists provide a variety of services to children, including cleanings, fillings, crown, orthodontic work and care for dental emergencies. They have specialized training, which includes four years of dental school and an additional two years of training in dentistry for children. If you're looking for the best oral health care for you child, consider the friendly staff at Southborough Dental Partners."
          }
        ]
      },
      {
        "heading": "Benefits of a Pediatric Dentist",
        "body": [
          {
            "type": "paragraph",
            "text": "Pediatric dentists are beneficial for children because they are gentle in nature. They understand that going to the dentist can be a scary experience for many children. As such, they offer a gentle approach to ensure your child is comfortable throughout the process. This often involves the use of special dental tools that may be decorated in a way to make your child feel more relaxed."
          },
          {
            "type": "paragraph",
            "text": "To make children comfortable, many pediatric dentists offer fun, inviting atmospheres. The rooms may be colorful and decorated with stuffed animals and cartoon characters. Some offer video games and toys in the waiting room. Many even allow children to watch movies and listen to music during the exam. At the end of the appointment, many pediatric dentists offer balloons and goodie bags to make the visit even more inviting."
          },
          {
            "type": "paragraph",
            "text": "Pediatric dentists work with both the children and their parents to promote healthy oral health habits. This means eliminating pacifier use and thumb sucking and proper care of teeth and gums. Parents will also be counseled on nutrition and how children should reduce sugar intake and focus on healthy foods, such as fruits and vegetables."
          }
        ]
      },
      {
        "heading": "Contact Us Today",
        "body": [
          {
            "type": "paragraph",
            "text": "Get your child on the right track with a dental checkup. Early dental care can help your children develop a healthy smile for life. Has your child been to the dentist lately? Schedule an appointment with Southborough Dental Partners today by calling (508) 357-8800 ."
          }
        ]
      }
    ],
    "sourceUrl": "https://southboroughdentalpartners.com/pediatric-dentist-southborough-ma/"
  }
]